{
    "dataCategories": [
        {
            "categoryId": 0,
            "displayName": "All Categories"
        },
        {
            "categoryId": 1,
            "displayName": "SQL"
        },
        {
            "categoryId": 2,
            "displayName": "Files"
        },
        {
            "categoryId": 3,
            "displayName": "Rest"
        }
    ],
  "dataConnectors": [
    {
      "category": 1,
      "displayName": "Microsoft SQL",
      "description": "SQL Server is Microsoft's relational database management system.As one of the most reliable and trusted database servers on the market, it comes with an assortment of value-added services like analysis, reporting, and more on top of the core database management system.The SQL Server connector allows you to access data from Microsoft SQL server databases within the Bold Report Designer.",
      "extType": "SQL",
      "itemType": "e-sql",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 1,
      "displayName": "Oracle",
      "description": "Oracle is an enterprise-grade relational database with advanced analytics features. The Oracle connector allows you to access data from Oracle databases within the Bold Report Designer.",
      "extType": "ORACLE",
      "itemType": "e-oracle",
      "accessibility": {
        "cloud": true,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "ODBC",
      "description": "An ODBC driver uses the Open Database Connectivity (ODBC) interface by Microsoft that allows applications to access data in database management systems (DBMS) using SQL as a standard for accessing the data.",
      "extType": "ODBC",
      "itemType": "e-odbc",
      "accessibility": {
        "cloud": false,
        "enterprise": true
      }
    },
    {
      "category": 1,
      "displayName": "OLEDB",
      "description": "OLE DB is Microsoft's strategic low-level application program interface (API) for access to different data sources. OLE DB includes not only the Structured Query Language (SQL) capabilities of the Microsoft-sponsored standard data interface Open Database Connectivity (ODBC) but also includes access to data other than SQL data.",
      "extType": "OLEDB",
      "itemType": "e-oledb",
      "accessibility": {
        "cloud": false,
        "enterprise": true
      }
    },
    {
      "category": 3,
      "displayName": "Web API",
      "description": "Connect with the Bold Report Designer using almost all data sources that have a REST API. Create reports and see the story that lives in your data.",
      "extType": "WebAPI",
      "itemType": "e-webapi",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 3,
      "displayName": "OData",
      "description": "OData is an open protocol to allow the creation and consumption of queryable and interoperable RESTful APIs in a simple and standard way. Connect with the Bold Report Designer and build reports to see the story that lives in your data.",
      "extType": "OData",
      "itemType": "e-odata",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 2,
      "displayName": "JSON",
      "description": "Bring your JSON files into the Bold Report Designer by uploading them to prepare reports and see the story that lives in your data.",
      "extType": "JSON",
      "itemType": "e-json",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 2,
      "displayName": "XML",
      "description": "Bring your XML files into the Bold Report Designer and prepare reports to see the story that lives in your data.",
      "extType": "XML",
      "itemType": "e-xml",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 1,
      "displayName": "PostgreSQL",
      "description": "PostgreSQL is a powerful and open-source object-relational database system emphasizing extensibility and standards compliance. The PostgreSQL connector allows you to access data from PostgreSQL databases within the Bold Report Designer.",
      "extType": "PostgreSQL",
      "itemType": "e-postgresql",
      "accessibility": {
        "cloud": true,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "Microsoft SQL Server Analysis Services",
      "description": "SQL Server Analysis Services (SSAS) is the technology from the Microsoft Business Intelligence stack, to develop Online Analytical Processing (OLAP) solutions. In simple terms, you can use SSAS to create cubes using data from data marts / data warehouse for deeper and faster data analysis.",
      "extType": "Microsoft SQL Server Analysis Services",
      "itemType": "e-custom",
      "accessibility": {
        "cloud": false,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "MySQL",
      "description": "MySQL is a freely available, open-source relational database management system, most noted for its quick processing, proven reliability, and ease and flexibility of use. The MySQL connector allows you to access data from MySQL databases within the Bold Report Designer.",
      "extType": "MySQL",
      "itemType": "e-mysql",
      "accessibility": {
        "cloud": true,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "MariaDB",
      "description": "MariaDB is a community-developed, commercially supported fork of the MySQL relational database management system that is guaranteed to stay open-source. The MariaDB connector allows you to access data from MariaDB databases within the Bold Report Designer.",
      "extType": "MariaDB",
      "itemType": "e-mariadb",
      "accessibility": {
        "cloud": true,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "MemSQL",
      "description": "MemSQL is a distributed, highly-scalable SQL database that can run anywhere. It delivers maximum performance for transactional and analytical workloads with familiar relational data structures. The MemSQL connector allows you to access data from MemSQL databases within the Bold Report Designer.",
      "extType": "MemSQL",
      "itemType": "e-memsql",
      "accessibility": {
        "cloud": true,
        "enterprise": false
      }
    },
    {
      "category": 2,
      "displayName": "CSV",
      "description": "Bring your CSV files into the Bold Report Designer and prepare reports to see the story that lives in your data.",
      "extType": "CSV",
      "itemType": "e-csv",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 2,
      "displayName": "Excel",
      "description": "Bring your Excel files as Tables or Worksheets into the Bold Report Designer. Explore and play with your data, prepare reports to see the story that lives in your data.",
      "extType": "Excel",
      "itemType": "e-excel",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 1,
      "displayName": "Azure Sql Data Warehouse",
      "description": "Azure SQL Data Warehouse is a Microsoft cloud-based enterprise data warehouse service offering. It leverages massively parallel processing to quickly run complex queries across petabytes of data. The Azure SQL Data Warehouse connector allows you to access data from Azure SQL Data Warehouse databases within the Bold Reports Designer.",
      "extType": "SQLAZURE",
      "itemType": "e-azuresqldw",
      "accessibility": {
        "cloud": true,
        "enterprise": true
      }
    },
    {
      "category": 1,
      "displayName": "CDATA",
      "description": "CDATA is a distributed, highly-scalable SQL database that can run anywhere. It delivers maximum performance for transactional and analytical workloads with familiar relational data structures.The cdata connector allows you to access data from cdata databases with MySQL endpoint within the Bold Reports Designer.",
      "extType": "CDATA",
      "itemType": "e-cdata",
      "accessibility": {
        "cloud": false,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "Amazon Aurora",
      "description": "Amazon Aurora is a relational database service developed and offered by Amazon Web Services. The Amazon Aurora connector allows you to access data from Amazon Aurora databases within the Bold Reports Designer.",
      "extType": "Amazon Aurora",
      "itemType": "e-amazon-aurora",
      "accessibility": {
        "cloud": false,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "Snowflake",
      "description": "Snowflake is a cloud-based data warehouse that provides an unbounded platform for storing and retrieving data. Unlike traditional single-cluster shared-disk/shared-nothing architectures, Snowflake has as a multi-cluster, shared data architecture that is dynamic and highly scalable thanks to enterprise class cloud-based storage systems.",
      "extType": "Snowflake",
      "itemType": "e-snowflake",
      "accessibility": {
        "cloud": false,
        "enterprise": false
      }
    },
    {
      "category": 1,
      "displayName": "Google BigQuery",
      "description": "BigQuery is a RESTful web service that enables interactive analysis of massive datasets working in conjunction with Google Storage. It is a serverless Software as a Service that may be used complementarily with MapReduce.",
      "extType": "Google BigQuery",
      "itemType": "e-google-bigquery",
      "accessibility": {
        "cloud": false,
        "enterprise": false
      }
    }
  ]
}